Revit 2026 API

# FabricRoundingManager Methods

---

The FabricRoundingManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ReinforcementRoundingManager) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLengthUnitTypeId | Gets the identifier of the length unit quantifying the reinforcement rounding values. (Inherited from ReinforcementRoundingManager) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FabricRoundingManager Class

Autodesk.Revit.DB.Structure Namespace